docs/blog/posts/blog-intro.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-07-20 Mon 23:29 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>This blog: gleanings and sowings</title>
<meta name="author" content="Paul T" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/tufte.css" type="text/css" />
<link rel="stylesheet" href="/ox-tufte.css" type="text/css" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<meta name="description" content="Paul S. Tang">
<meta name="twitter:creator" content="@_ptsw">
<meta name="twitter:card" content="summary">
<link rel="canonical" href="https://ptsw.ca">
<link href="/feed.xml" type="application/atom+xml" rel="alternate" title="plateaux Feed">
</head>
<body>
<header id="preamble" class="status">
<nav>
  <div class="site-title"><a href="/">plateaux</a></div>
  <div class="site-nav">
    <a href="/about/">About</a>
    <a href="/stuff/">Stuff</a>
    <a href="/blog/">Posts</a>
    <a href="/books/">Reading</a>
  </div>
</nav>
<br/>
</header>
<article id="content" class="content">
<header>
<h1 class="title">This blog: gleanings and sowings</h1>
</header><p>
This blog is intended as a collection of gleanings and sowings &#x2014; <a href="https://ncatlab.org/nlab/show/R%C3%A9coltes+et+semailles">récoltes et semailles</a> &#x2014; of morsels of knowledge accumulated through some years of trial and effort in my attempts to understand topics that I found engaging or difficult.
</p>

<p>
Topics include, but are not limited to: mathematics (pure and applied), statistics, <a href="https://www.oxfordbibliographies.com/view/document/obo-9780199756384/obo-9780199756384-0054.xml">social theory</a>, economics (political economy, macroeconomics, financial economics), informatics, physics, machine learning, and biology (computational, evolutionary).
</p>


<p>
Some words of warning for any potential readers: the dates on these posts are effectively meaningless &#x2014; they exist to satisfy a Jekyll requirement for a specific date &#x2014; but somewhat correlate with the <i>start</i> of writing rather than date of publication. In a possibly postmodern turn, I reserve the right to edit posts in the future without warning.
</p>

<p>
That said, hopefully the writing is at least tolerable, if not enjoyable.
</p>
</article>
<footer id="postamble" class="status">

  <a href="https://twitter.com/_ptsw">Twitter</a>
  <a href="https://github.com/paultsw">GitHub</a>
  <a href="https://stackoverflow.com/users/3141064/ptsw">StackOverflow</a>
</footer>
</body>
</html>
